WELCOME_TEXT = """
<b>{username}</b>, добро пожаловать в официальный бот программы лояльности Суши Мастер. Мы очень рады, что ты с нами!
 
Теперь управлять бонусами стало еще проще. Я помогу тебе в любой момент:
 
Узнать баланс. Актуальное количество баллов всегда под рукой.
Посмотреть историю. Все твои начисления и списания бонусов в одном разделе.
Индивидуальные акции и промокоды. Персональные предложения для выгодных заказов. 
 
Нажимай на кнопки меню внизу экрана, чтобы начать. 
 
Пользуйся с удовольствием, Всё получится!
"""

ADRESS_TEXT = """

📍Адреса ресторанов: https://tyumen.sushi-master.ru/our-restourants
📍Сообщество в ВК: https://vk.com/sushi_takeaway 
📍 Канал в MAX: https://max.ru/sushimaster_rus 
📍 Канал в Telegram: https://t.me/sushimaster_rus

"""

LOYATLY_TEXT = """

💰 Получите КЭШБЭК с каждого заказа!
Экономьте и расплачивайтесь бонусами с нашей бонусной программой

Мы очень любим, когда вы выбираете Суши Мастер, поэтому все аппетитные заказы вернутся к вам приятным бонусом! С каждой порцией любимых блюд вы получите до 10% обратно на свой бонусный счет.

🎁 Как это работает?
Никаких лишних действий – только выгода с первой секунды! Оформляйте первый заказ, и мы автоматически активируем ваш бонусный счет, щедро пополнив его 150 приветственными баллами.

🍣 Следующие заказы
Теперь бонусный баланс в ваших руках! Делайте заказы регулярно в Суши Мастер и копите баллы, отслеживая пополнения в личном кабинете. Чем больше сумма заказа, тем больше кешбэк.

🔥 Все просто!
Размер кешбэка зависит от суммы вашего заказа:

до 1000 ₽ – 1%
1001-1500 ₽ – 3%
1501-1800 ₽ – 5%
1801-2500 ₽ – 7%
2501 ₽ и более – 10%

А еще, можно объединить свой аккаунт на сайте с сообществом Суши Мастер во Вконтакте и получать баллы за активность (до 300 баллов в месяц)!

за 1 лайк - 2 балла;
за 1 репост - 5 баллов;
за 1 комментарий - 5 баллов.

⚠️ Главное не забывать о нас месяца на три: через 90 дней бонусы обнуляются!
Но вы же не позволите им, правда?

Вы можете оплачивать своими бонусами до 30% заказа!

✅ FAQ
На что не действует бонусная система?
На одноразовые и регулярные тематические акции, на стоимость доставки и на товары со скидкой (акционные сеты и любые другие позиции с пометкой "Акция").

С чем не суммируются бонусные баллы?
С подарками, призами, сертификатами, скидками и промокодами

Будет ли кэшбэк на заказ, который вы оплатили бонусами?
Да! При оплате бонусными баллами 30% заказа, начисление баллов происходит на остаток
"""

