WELCOME_TEXT = """
<b>{username}</b>, добро пожаловать в официальный бот программы лояльности Суши Мастер. 

Мы очень рады, что ты с нами! 👋🏻

Теперь управлять заказами и бонусами стало еще проще. Я помогу тебе в любой момент:

✅ Узнать бонусный баланс. Актуальное количество баллов всегда под рукой.
✅ Посмотреть историю. Все твои начисления и списания в одном разделе.
✅ Уточнить адреса. Подскажу расположение наших ресторанов и актуальный график работы.
✅ Заказать доставку. Помогу быстро перейти к меню, чтобы выбрать любимые блюда.

Нажимай на кнопки меню внизу экрана, чтобы начать.

🤝 Пользуйся с удовольствием. Всё получится!
"""

WELCOME_TEXT_FOR_PROMO = """

👋🏻 <b>{username}</b>, добро пожаловать в официальный бот программы лояльности Суши Мастер. 

Мы очень рады, что ты с нами и приготовили для тебя подарок 🎁! 

Для получения подарка необходимо зарегистрироваться. 

Я помогу тебе в любой момент:

✅ Узнать бонусный баланс. Актуальное количество баллов всегда под рукой.
✅ Посмотреть историю. Все твои начисления и списания в одном разделе.
✅ Уточнить адреса. Подскажу расположение наших ресторанов и актуальный график работы.
✅ Заказать доставку. Помогу быстро перейти к меню, чтобы выбрать любимые блюда.

Нажимай на кнопки меню внизу экрана, чтобы начать.

🤝 Пользуйся с удовольствием. Всё получится!
"""

ADRESS_TEXT = """

📍 Адреса ресторанов: https://tyumen.sushi-master.ru/our-restourants
📍 Сообщество в ВК: https://vk.com/sushi_takeaway 
📍 Канал в MAX: https://max.ru/sushimaster_rus 
📍 Канал в Telegram: https://t.me/sushimaster_rus

"""

LOYATLY_TEXT = """

💰 Получите КЭШБЭК с каждого заказа!
Экономьте и расплачивайтесь бонусами с нашей бонусной программой

Мы очень любим, когда вы выбираете Суши Мастер, поэтому все аппетитные заказы вернутся к вам приятным бонусом! С каждой порцией любимых блюд вы получите до 10% обратно на свой бонусный счет.

🎁 Как это работает?
Никаких лишних действий – только выгода с первой секунды! Оформляйте первый заказ, и мы автоматически активируем ваш бонусный счет, щедро пополнив его 150 приветственными баллами.

🍣 Следующие заказы
Теперь бонусный баланс в ваших руках! Делайте заказы регулярно в Суши Мастер и копите баллы, отслеживая пополнения в личном кабинете. Чем больше сумма заказа, тем больше кешбэк.

🔥 Все просто!
Размер кешбэка зависит от суммы вашего заказа:

до 1000 ₽ – 1%
1001-1500 ₽ – 3%
1501-1800 ₽ – 5%
1801-2500 ₽ – 7%
2501 ₽ и более – 10%

А еще, можно объединить свой аккаунт на сайте с сообществом Суши Мастер во Вконтакте и получать баллы за активность (до 300 баллов в месяц)!

за 1 лайк - 2 балла;
за 1 репост - 5 баллов;
за 1 комментарий - 5 баллов.

⚠️ Главное не забывать о нас месяца на три: через 90 дней бонусы обнуляются!
Но вы же не позволите им, правда?

Вы можете оплачивать своими бонусами до 30% заказа!

✅ FAQ
На что не действует бонусная система?
На одноразовые и регулярные тематические акции, на стоимость доставки и на товары со скидкой (акционные сеты и любые другие позиции с пометкой "Акция").

С чем не суммируются бонусные баллы?
С подарками, призами, сертификатами, скидками и промокодами

Будет ли кэшбэк на заказ, который вы оплатили бонусами?
Да! При оплате бонусными баллами 30% заказа, начисление баллов происходит на остаток
"""

POLICY_TEXT = """

<b>Для продолжения необходимо ознакомиться с документами и подтвердить согласие. </b>

Настоящим (нажимая кнопку «Согласен»), я, даю конкретное, предметное, информированное, сознательное и однозначное согласие АО «СУШИМАГ» (ИНН: 7500008890, адрес местонахождения: 358009, Республика Калмыкия, г. о. город Элиста, г. Элиста, мкр. 3, д. 4, помещ. 26) на обработку моих персональных данных, а именно: 

номера телефона, полученного при использовании чат-бота в «Телеграм» (бот программы лояльности «Суши Мастер») в целях регистрации в бонусной программе, информирования о статусе бонусов; 
начисления и списания бонусов, оформления заказов; 
получения рекламной и другой информации.

Обработка персональных данных может осуществляться с использованием средств автоматизации или без таковых, а также путем смешанной обработки персональных данных, включая: сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, анализ и использование. 

Настоящее согласие действует с даты его выдачи (даты нажатия кнопки "Согласен") и до момента его отзыва. Настоящее согласие может быть отозвано путем направления письменного уведомления по адресу местонахождения АО «СУШИМАГ», либо на электронную почту: marketing@sushi-master.ru

Вся необходимая информация представлена по ссылке:
https://tyumen.sushi-master.ru/personal-data-processing

"""

WELCOME_PRIZE_TEXT = """

Ой, подарок уже переминается с лапки на лапку и очень хочет к тебе! 🎁🐾

Осталось только подписаться на федеральный Telegram-канал Суши Мастер. Там живут пушистые котики и секретные скидки. 🐱🤫

Кликай на ссылку (кнопку) и всё получится! ✨👆

"""

LAVA_PRIZE = """

Поздравляем, ты официально в банде любимчиков Суши Мастер 🤝
Забирай нежную Лаву с креветкой к любому заказу от 999 рублей.
 
Твой промокод: ЛАВЫЧ
 
*Маленькое напоминание: использовать промокод нужно до 25.12.2026 г., акции и оплата бонусными баллами не пересекаются.
 
Приятного аппетита!

"""



